# Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.
# Пример:
# 1, 4, 8, 7, 5 -> 8
# 78, 55, 36, 90, 2 -> 90

# РЕШЕНИЕ 1: ==========================================================================================================================

# numbers = [] # создаем предварительный пустой список
# for i in range(5): # заполняем циклом список, функция "range" генерирует последовательности
# # если в range один аргумент - генерит последовательность от 0-4, когда 2 элемента, то от 1 до 2
# # если 3 аргумента - range(n, -n, -1), то -1 - это шаг, которым мы идем от от n до -n
#     n = int(input())
#     numbers.append(n) # append  добавляет в конец списка число, указанное в аргументе
# max = numbers[0]
# for el in numbers: # в переменной "el" будет записываться значение ячейки в списке numbers, а не индекс ячейки
#     if el > max: # будет брать не номер а значение из списка
#         max = el
# print(f'Максимальное число: {max}')

# РЕШЕНИЕ 2: ==========================================================================================================================

# numbers = []
# for i in range(5):
#     numbers.append(int(input('Введите число: '))) # Только таким образом будет добавлять в список значения
#     # потому что мы не можем записывать индекс в пустоту, мы можем только менять - см. решение 3
# max = numbers[0]
# for el in numbers:
#     if el > max:
#         max = el
# print(f'Максимальное число: {max}')

# РЕШЕНИЕ 3: ==========================================================================================================================

# numbers = [0] * 5 # равносильно [0, 0, 0, 0, 0]  
# for i in range(5):
#     numbers[i] = int(input('Введите число: ')) # такой ввод сработает, так как мы меняем значение ячейки (изначально нули)
# print(numbers)
# max = numbers[0]
# for el in numbers:
#     if el > max:
#         max = el
# print(f'Максимальное число: {max}')

# РЕШЕНИЕ 4: ==========================================================================================================================

# numbers = []
# for i in range(5):
#     numbers.append(int(input('Введите число: ')))
# print(max(numbers))

# РЕШЕНИЕ 5: ЛУЧШИЙ ВАРИАНТ ==========================================================================================================

max = int(input('Введите число: '))
for i in range(4): # 4, так как первое значение мы ввели в max
    n = int(input('Введите число: ')) 
    if n > max:
        max = n
print(max)

# РЕШЕНИЕ 6: ==========================================================================================================================

# print(max(list(map(int, input('Введите число: ').split()))))
# вывод(максимальное значение(списка(присвоить ко всем(значение int, ввод('Введите число: ').разделить(пробелом))))
