# Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.
#     *Примеры:*
#     - 6,78 -> 7
#     - 5 -> нет
#     - 0,34 -> 3

# Решение 1: ==========================================================================================================================

# some_str = input() # 6,78
# if ',' in some_str: # функцией in проверяем, есть ли ',' в строке some_str
#     some_list = some_str.split(',') # разделили строку по запятой
#     print(some_list) # получим ['6', '78']
#     print(some_list[1]) # указывая индекс [1], выведет вторую ячеку -> 78
#     print(some_list[1][0]) # указывая индексы [1][0], выведем строку 78 и её первый индекс -> 7
# else:
#     print('Нет')

# РЕШЕНИЕ 2: ==========================================================================================================================

# some_str = input() # вводим число 6,78
# if ',' in some_str: # если в строке есть ","
#     ind = some_str.index(',') # Создаем переменную ind и в неё записываем индекс запятой
#     #print(ind)
#     print(some_str[ind + 1]) # Выводим символ строки, указывая её индекс
# else:
#     print('нет')

# РЕШЕНИЕ 3: ==========================================================================================================================

number = float(input()) # на вход приняли вещественное число 6.78
if number % 1 != 0: # Проверили, что число дробное
    number *= 10 # смещаем запятую влево: 6.78 -> 67.8
    number = int(number) # переводим в int убирая десятичные
    print(number % 10) # выводим 7
else:
    print('нет')
