# Напишите программу, которая принимает на вход два числа и проверяет,
# является ли одно число квадратом второго
# Примеры:
# 5, 25 -> да
# 4, 16 -> да
# 25, 5 -> да
# 8, 9 -> нет

# РЕШЕНИЕ 1: =========================================================================================================================

# x = int(input('ВВедите первое число: '))
# y = int(input('Введите второе число: '))
# x, y = int(input('ВВедите первое число: ')), int(input('Введите второе число: ')) # - параллельное присваивание
# if x ** 2 == y or y ** 2 == x:  # ** - возведение в степень
#     print('Да')
# else:
#     print('Нет')

# РЕШЕНИЕ 2: =========================================================================================================================

# some_str = input().split() # 5, 25
# print(some_str)            # ['5,', '25']

# функция split() разделяет строки по пробелу

# some_str = input('Введите два числа: ').split(', ') #    5, 25 -> ['5', '25']
# # some_str стал списком 
# # print(some_str)             
# x = int(some_str[0]) # приводим первое значение списка из string в int
# y = int(some_str[1])
# if x ** 2 == y or y ** 2 == x: 
#     print('Да')
# else:
#     print('Нет')

# РЕШЕНИЕ 3: =========================================================================================================================

x, y = map(int, input('Введите 2 числа: ').split(', ')) 
# функция 'map' ко всему вводу применяет функцию 'int' -> map(функция, ввод)
if x ** 2 == y or y ** 2 == x: 
    print('Да')
else:
    print('Нет')